Working with CSV's

In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("data.csv")

In [5]:
df

      Name   School  Marks
0   Aniket       kv     78
1     Alek       st     84
2     Ashu      hub     59
3  Chandan   stmary     45
4      Dev  stpeter     78
5     Abhi     sans     98
6      Ani     audi     63
7     Udit     aghi     55

In [6]:
df = df[df['Marks']>60]

In [7]:
df

     Name   School  Marks
0  Aniket       kv     78
1    Alek       st     84
4     Dev  stpeter     78
5    Abhi     sans     98
6     Ani     audi     63

In [9]:
df.to_csv("data_updated.csv", index=False)

In [10]:
df = pd.read_json("data.json")

df